_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ДинамикаВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_ДинамикаВыполненияРабот</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ВыполнениеРаботЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ВыполнениеРаботЗаказчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_УчетВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_УчетВыполненныхРабот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ДинамикаВыполненияРабот/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПериодОтчета) Тогда
		ПоказатьПредупреждение(,"Не выбрана дата отчета!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		ПоказатьПредупреждение(,"Не выбран объект строительства!");
		Возврат;
	КонецЕсли;
	
	КомандаСформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	
	ДиаграммаГанта.Серии.Получить(0).Цвет = ЦветСерииПлан;
	ДиаграммаГанта.Серии.Получить(1).Цвет = ЦветСерииФакт;
	ДиаграммаГанта.Серии.Получить(2).Цвет = ЦветСерииПрогноз;
	
	Запрос.УстановитьПараметр("ПериодОтчета",КонецДня(ПериодОтчета));
	Запрос.УстановитьПараметр("ОбъектСтроительства",ОбъектСтроительства);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УСОERP_ВыполнениеРаботЗаказчика.Регистратор.ДокументУтверждения.КопияСценария КАК КопияСценария
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботЗаказчика КАК УСОERP_ВыполнениеРаботЗаказчика
	|ГДЕ
	|	УСОERP_ВыполнениеРаботЗаказчика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И УСОERP_ВыполнениеРаботЗаказчика.ОбъектСтроительства = &ОбъектСтроительства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботыРаспределение.Ссылка КАК Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА УСОERP_СтроительныеРаботыРаспределение.Дата <= &ПериодОтчета
	|				ТОГДА УСОERP_СтроительныеРаботыРаспределение.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемПлан,
	|	УСОERP_СтроительныеРаботыРаспределение.Ссылка.РаботаИсточник КАК РаботаИсточник
	|ПОМЕСТИТЬ ВрТабПлановыеОбъемы
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы.Распределение КАК УСОERP_СтроительныеРаботыРаспределение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТаб КАК ВрТаб
	|		ПО УСОERP_СтроительныеРаботыРаспределение.Ссылка.Владелец = ВрТаб.КопияСценария
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_СтроительныеРаботыРаспределение.Ссылка,
	|	УСОERP_СтроительныеРаботыРаспределение.Ссылка.РаботаИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ВыполнениеРаботЗаказчика.Работа КАК Работа,
	|	УСОERP_ВыполнениеРаботЗаказчика.ДатаНачала КАК ДатаНачалаПлан,
	|	УСОERP_ВыполнениеРаботЗаказчика.ДатаОкончания КАК ДатаОкончанияПлан,
	|	ВрТабПлановыеОбъемы.ОбъемПлан КАК ОбъемПлан
	|ПОМЕСТИТЬ ВрТабПлан
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботЗаказчика КАК УСОERP_ВыполнениеРаботЗаказчика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТабПлановыеОбъемы КАК ВрТабПлановыеОбъемы
	|		ПО УСОERP_ВыполнениеРаботЗаказчика.Работа = ВрТабПлановыеОбъемы.РаботаИсточник
	|ГДЕ
	|	УСОERP_ВыполнениеРаботЗаказчика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И УСОERP_ВыполнениеРаботЗаказчика.ОбъектСтроительства = &ОбъектСтроительства
	|	И УСОERP_ВыполнениеРаботЗаказчика.ДатаНачала <= &ПериодОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_УчетВыполненныхРабот.Работа КАК Работа,
	|	МИНИМУМ(УСОERP_УчетВыполненныхРабот.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(УСОERP_УчетВыполненныхРабот.ДатаОкончания) КАК ДатаОкончания,
	|	СУММА(УСОERP_УчетВыполненныхРабот.Объем) КАК Объем,
	|	МИНИМУМ(УСОERP_УчетВыполненныхРабот.Период) КАК ДатаНачалаФакт,
	|	МАКСИМУМ(УСОERP_УчетВыполненныхРабот.Период) КАК ДатаОкончанияФакт,
	|	ВрТабПлановыеОбъемы.ОбъемПлан КАК ОбъемПлан,
	|	МИНИМУМ(УСОERP_УчетВыполненныхРабот.Период) КАК ПериодФактМинимум,
	|	МАКСИМУМ(УСОERP_УчетВыполненныхРабот.Период) КАК ПериодФактМаксимум
	|ПОМЕСТИТЬ ВрТабФакт
	|ИЗ
	|	РегистрНакопления.УСОERP_УчетВыполненныхРабот КАК УСОERP_УчетВыполненныхРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТабПлановыеОбъемы КАК ВрТабПлановыеОбъемы
	|		ПО УСОERP_УчетВыполненныхРабот.Работа = ВрТабПлановыеОбъемы.РаботаИсточник
	|ГДЕ
	|	УСОERP_УчетВыполненныхРабот.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И УСОERP_УчетВыполненныхРабот.ОбъектСтроительства = &ОбъектСтроительства
	|	И УСОERP_УчетВыполненныхРабот.Период <= &ПериодОтчета
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_УчетВыполненныхРабот.Работа,
	|	ВрТабПлановыеОбъемы.ОбъемПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТабФакт.Работа КАК Работа,
	|	ВрТабФакт.ДатаНачала КАК ДатаНачала,
	|	ВрТабФакт.ДатаОкончания КАК ДатаОкончания,
	|	ВрТабФакт.Объем КАК Объем,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(УСОERP_УчетВыполненныхРабот.Регистратор.ДатаНачалаПериода, УСОERP_УчетВыполненныхРабот.ДатаНачала, СЕКУНДА) > 0
	|				ТОГДА УСОERP_УчетВыполненныхРабот.Регистратор.ДатаНачалаПериода
	|			ИНАЧЕ УСОERP_УчетВыполненныхРабот.ДатаНачала
	|		КОНЕЦ) КАК ДатаНачалаФакт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(ВрТабФакт.ДатаОкончанияФакт, УСОERP_УчетВыполненныхРабот.ДатаНачала, СЕКУНДА) > 0
	|				ТОГДА УСОERP_УчетВыполненныхРабот.ДатаНачала
	|			ИНАЧЕ ВрТабФакт.ДатаОкончанияФакт
	|		КОНЕЦ) КАК ДатаОкончанияФакт,
	|	ВрТабФакт.ОбъемПлан КАК ОбъемПлан,
	|	ВрТабФакт.ПериодФактМинимум КАК ПериодФактМинимум,
	|	МАКСИМУМ(ВрТабФакт.ПериодФактМаксимум) КАК ПериодФактМаксимум
	|ПОМЕСТИТЬ ВрТабФакт_Даты
	|ИЗ
	|	ВрТабФакт КАК ВрТабФакт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_УчетВыполненныхРабот КАК УСОERP_УчетВыполненныхРабот
	|		ПО ВрТабФакт.ДатаНачалаФакт = УСОERP_УчетВыполненныхРабот.Период
	|			И ВрТабФакт.Работа = УСОERP_УчетВыполненныхРабот.Работа
	|ГДЕ
	|	УСОERP_УчетВыполненныхРабот.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТабФакт.Работа,
	|	ВрТабФакт.ДатаНачала,
	|	ВрТабФакт.ДатаОкончания,
	|	ВрТабФакт.Объем,
	|	ВрТабФакт.ОбъемПлан,
	|	ВрТабФакт.ПериодФактМинимум
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВрТабПлан.Работа, ВрТабФакт_Даты.Работа) КАК Работа,
	|	ЕСТЬNULL(ВрТабПлан.ДатаНачалаПлан, ВрТабФакт_Даты.ДатаНачала) КАК ДатаНачалаПлан,
	|	ЕСТЬNULL(ВрТабПлан.ДатаОкончанияПлан, ВрТабФакт_Даты.ДатаОкончания) КАК ДатаОкончанияПлан,
	|	ЕСТЬNULL(ВрТабПлан.ОбъемПлан, ВрТабФакт_Даты.ОбъемПлан) КАК ОбъемПлан,
	|	ЕСТЬNULL(ВрТабФакт_Даты.Объем, 0) КАК ОбъемФакт,
	|	ЕСТЬNULL(ВрТабФакт_Даты.ДатаНачалаФакт, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаФакт,
	|	ЕСТЬNULL(ВрТабФакт_Даты.ДатаОкончанияФакт, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияФакт,
	|	ВрТабФакт_Даты.ПериодФактМинимум КАК ПериодФактМинимум,
	|	ВрТабФакт_Даты.ПериодФактМаксимум КАК ПериодФактМаксимум
	|ПОМЕСТИТЬ ВрТабПланФакт
	|ИЗ
	|	ВрТабПлан КАК ВрТабПлан
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВрТабФакт_Даты КАК ВрТабФакт_Даты
	|		ПО ВрТабПлан.Работа = ВрТабФакт_Даты.Работа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТабПлановыеОбъемы.Ссылка.КодСДР КАК КодСДР,
	|	ВрТабПлановыеОбъемы.Ссылка КАК Работа,
	|	ВрТабПлановыеОбъемы.Ссылка.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ВрТабПланФакт.ОбъемПлан КАК ОбъемПлан,
	|	ВрТабПланФакт.ОбъемФакт КАК ОбъемФакт,
	|	ВЫБОР
	|		КОГДА ВрТабПланФакт.ОбъемПлан = 0
	|			ТОГДА 100
	|		ИНАЧЕ ВрТабПланФакт.ОбъемФакт * 100 / ВрТабПланФакт.ОбъемПлан
	|	КОНЕЦ КАК ПроцентВыполнения,
	|	ВрТабПланФакт.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ВрТабПланФакт.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ВрТабПланФакт.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	ВрТабПланФакт.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	0 КАК Отставание,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Прогноз,
	|	ВрТабПланФакт.ПериодФактМинимум КАК ПериодФактМинимум,
	|	ВрТабПланФакт.ПериодФактМаксимум КАК ПериодФактМаксимум
	|ИЗ
	|	ВрТабПланФакт КАК ВрТабПланФакт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТабПлановыеОбъемы КАК ВрТабПлановыеОбъемы
	|		ПО ВрТабПланФакт.Работа = ВрТабПлановыеОбъемы.РаботаИсточник";	
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
		
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		
		Отставание = 0;
		Прогноз = Дата(1,1,1);
		
		//Отставание
		
		ДатаОкончанияФакт = ?(СтрокаТЗ.ОбъемФакт < СтрокаТЗ.ОбъемПлан,Дата(1,1,1),СтрокаТЗ.ДатаОкончанияФакт);
		
		Если ЗначениеЗаполнено(ДатаОкончанияФакт) Тогда
			
			Если СтрокаТЗ.ДатаОкончанияФакт > СтрокаТЗ.ДатаОкончанияПлан Тогда
				
				Отставание = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаОкончанияПлан,СтрокаТЗ.ДатаОкончанияФакт)-1;
				
			Иначе
				
				ОтставаниеМинус = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаОкончанияФакт,СтрокаТЗ.ДатаОкончанияПлан)-1;
				Отставание = -ОтставаниеМинус;
				
			КонецЕсли;
			
		Иначе
			
			Если РасчетПрогноза = 0 Тогда
				
				РазностьДатыОтчета = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаПлан,ПериодОтчета)-1;
				РазностьДатыПлан =   КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаПлан,СтрокаТЗ.ДатаОкончанияПлан)-1;
				Отставание = Окр((РазностьДатыОтчета-РазностьДатыПлан)*СтрокаТЗ.ПроцентВыполнения/100,0);
				
			ИначеЕсли РасчетПрогноза = 1 Тогда
				
				Если ЗначениеЗаполнено(СтрокаТЗ.ДатаНачалаФакт) И ЗначениеЗаполнено(СтрокаТЗ.ПериодФактМаксимум) Тогда
					
					РазностьДатыОтчета = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаФакт,ПериодОтчета)-1;
					
					Если СтрокаТЗ.ДатаНачалаФакт > СтрокаТЗ.ПериодФактМаксимум Тогда
						
						РазностьДатыФакт =   КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаФакт,СтрокаТЗ.ПериодФактМаксимум)-1;
						
					Иначе
						
						РазностьДатыФакт =   КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ПериодФактМаксимум,СтрокаТЗ.ДатаНачалаФакт)-1;
						РазностьДатыФакт = -РазностьДатыФакт;
						
					КонецЕсли;
					
					Отставание = ОКР((РазностьДатыОтчета-РазностьДатыФакт)*СтрокаТЗ.ПроцентВыполнения/100,0);
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЕсли;  		
		
		//Прогноз
		
		Если НЕ ЗначениеЗаполнено(ДатаОкончанияФакт) Тогда
			
			//Если СтрокаТЗ.ПроцентВыполнения > 0 Тогда
			
			Если РасчетПрогноза = 0 Или СтрокаТЗ.ПроцентВыполнения = 0 Тогда
				
				ДлительностьПлан =  КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаПлан,СтрокаТЗ.ДатаОкончанияПлан)-1;
				
				ДлительностьПрогнозная = ОКР(ДлительностьПлан*(100-СтрокаТЗ.ПроцентВыполнения)/100,0);										
				
			Иначе
				
				Если ЗначениеЗаполнено(СтрокаТЗ.ПериодФактМаксимум) Тогда
					
					Если   СтрокаТЗ.ПериодФактМаксимум > СтрокаТЗ.ДатаНачалаФакт Тогда
						
						ДлительностьФакт =  КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ПериодФактМаксимум,СтрокаТЗ.ДатаНачалаФакт)-1;
						
					Иначе
						
						ДлительностьФакт =  КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаФакт,СтрокаТЗ.ПериодФактМаксимум)-1;
						
						ДлительностьФакт = -ДлительностьФакт;
						
						
					КонецЕсли;
					
				Иначе
					
					ДлительностьФакт =  КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаНачалаФакт,ПериодОтчета)-1;
					
				КонецЕсли;					
				
				ДлительностьПрогнозная = ОКР(ДлительностьФакт*(100-СтрокаТЗ.ПроцентВыполнения)/100,0);
				
				
				//КонецЕсли; 
				
				//Прогноз = КалендарныеГрафики.ДатаПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,ПериодОтчета,ДлительностьПрогнозная,Ложь);
				//
				//Если Прогноз = Неопределено Тогда
				//	
				//	Прогноз = ПериодОтчета+ДлительностьПрогнозная*24*60*60;
				//	
				//КонецЕсли;  				
				
			КонецЕсли;
			
			Прогноз = КалендарныеГрафики.ДатаПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,ПериодОтчета,ДлительностьПрогнозная,Ложь);
			
			Если Прогноз = Неопределено Тогда
				
				Прогноз = ПериодОтчета+ДлительностьПрогнозная*24*60*60;
				
			КонецЕсли;  	
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Прогноз) Тогда
		
		Если Прогноз > СтрокаТЗ.ДатаОкончанияПлан Тогда
			Отставание = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,СтрокаТЗ.ДатаОкончанияПлан,Прогноз);
		Иначе
			Отставание = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(СтрокаТЗ.Работа.ГрафикРаботы,Прогноз,СтрокаТЗ.ДатаОкончанияПлан);
			Отставание = -Отставание;
		КонецЕсли;
		
		КонецЕсли;		
		
		СтрокаТЗ.Отставание = Отставание;
		СтрокаТЗ.Прогноз = Прогноз;
		
	КонецЦикла; 
	
	ТабличныйДокумент.Очистить();
	ДиаграммаГанта.Точки.Очистить();  	
	
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
	|	ТЗ.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ТЗ.ОбъемПлан КАК ОбъемПлан,
	|	ТЗ.ОбъемФакт КАК ОбъемФакт,
	|	ТЗ.ПроцентВыполнения КАК ПроцентВыполнения,
	|	ТЗ.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ТЗ.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ТЗ.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	ТЗ.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	ТЗ.Отставание КАК Отставание,
	|	ТЗ.Прогноз КАК Прогноз
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Работа.КодСДР КАК КодСДР,
	|	ВрТаб.Работа КАК Работа,
	|	ВрТаб.Работа.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ВрТаб.ОбъемПлан КАК ОбъемПлан,
	|	ВрТаб.ОбъемФакт КАК ОбъемФакт,
	|	ВрТаб.ПроцентВыполнения КАК ПроцентВыполнения,
	|	ВрТаб.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ВрТаб.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ВрТаб.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	ВрТаб.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	ВрТаб.Отставание КАК Отставание,
	|	ВрТаб.Прогноз КАК Прогноз,
	|	ВрТаб.Работа.СуммарнаяРабота КАК СуммарнаяРабота,
	|	ВЫБОР
	|		КОГДА ВрТаб.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ПериодОтчета
	|		ИНАЧЕ ВрТаб.ДатаНачалаФакт
	|	КОНЕЦ КАК ДатаНачалаФакт_Заполненный
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВрТаб.Работа.ПорядокСортировки
	|ИТОГИ
	|	СУММА(ОбъемПлан),
	|	СУММА(ОбъемФакт),
	|	СУММА(ПроцентВыполнения),
	|	МИНИМУМ(ДатаНачалаПлан),
	|	МИНИМУМ(ДатаНачалаФакт),
	|	МАКСИМУМ(ДатаОкончанияПлан),
	|	МАКСИМУМ(ДатаОкончанияФакт),
	|	СУММА(Отставание),
	|	МАКСИМУМ(Прогноз),
	|	МИНИМУМ(ДатаНачалаФакт_Заполненный)
	|ПО
	|	ОБЩИЕ,
	|	Работа ИЕРАРХИЯ";
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ТЗ.Количество() Тогда
		Возврат;
	КонецЕсли; 	
	
	ТекРабота = Неопределено;
	
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		
		Если СтрокаТЗ.Работа = ТекРабота ИЛИ СтрокаТЗ.Работа = NULL Тогда
			Продолжить;
		КонецЕсли; 		
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСтрока");
		
		Если СтрокаТЗ.Работа.СуммарнаяРабота Тогда
			
			ОбластьМакета.Параметры.КодСДР = СтрокаТЗ.Работа.КодСДР;
			ОбластьМакета.Параметры.Работа = СтрокаТЗ.Работа;
			
		Иначе
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТЗ);
			
			Если СтрокаТЗ.ОбъемФакт < СтрокаТЗ.ОбъемПлан Тогда
				ОбластьМакета.Параметры.ДатаОкончанияФакт = "";
			КонецЕсли;
			
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);   
		
		ТекРабота = СтрокаТЗ.Работа;
		
	КонецЦикла;
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СтрокаОбщие = Дерево.Строки.Получить(0);
	
	ЗаполнитьДиаграммуГанта(СтрокаОбщие);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(Дерево)
	
	Диаграмма = ДиаграммаГанта;
	Диаграмма.Обновление = Ложь;
	
	Для Каждого Шкала Из Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы Цикл
		Шкала.Метки.Очистить();
	КонецЦикла;	
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	Диаграмма.ОтображатьЗаголовок = Ложь;
	Диаграмма.ОбластьПостроения.Право = 1;
	Диаграмма.ОтображатьПустыеЗначения = Ложь;
	
	// Серии
	
	СтруктураСерий = Новый Структура;
	СерияПлан = Диаграмма.Серии.Получить(0);
	СтруктураСерий.Вставить("План", СерияПлан); 	
	СерияФакт = Диаграмма.Серии.Получить(1);
	СтруктураСерий.Вставить("Факт", СерияФакт); 
	СерияПрогноз = Диаграмма.Серии.Получить(2);
	СтруктураСерий.Вставить("Прогноз", СерияПрогноз);  	
	
	МаксимальнаяДата = Макс(Дерево.ДатаОкончанияПлан,?(ЗначениеЗаполнено(Дерево.ДатаОкончанияФакт),Дерево.ДатаОкончанияФакт,Дерево.ДатаОкончанияПлан));
	МинимальнаяДата = Мин(Дерево.ДатаНачалаПлан,?(ЗначениеЗаполнено(Дерево.ДатаНачалаФакт),Дерево.ДатаНачалаФакт,Дерево.ДатаНачалаПлан)); 
	
	СписокРабот = Новый СписокЗначений;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		ЗаполнитьТочкуДиаграммыГанта(СтрокаДерева, СтруктураСерий, МаксимальнаяДата, МинимальнаяДата);
		СписокРабот.Добавить(СтрокаДерева.Работа);
		
	КонецЦикла;  
	
	Диаграмма.Обновление = Истина;
	
	Диаграмма.ПоддержкаМасштаба = ?(ПолосаРегулированияДиаграммыГанта = 0, ПоддержкаМасштабаДиаграммыГанта.Авто, ПоддержкаМасштабаДиаграммыГанта.Период);
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	
	Диаграмма.УстановитьПолныйИнтервал(НачалоМесяца(МинимальнаяДата), КонецМесяца(МаксимальнаяДата)); 	
	
	Диаграмма.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.Право;
	Диаграмма.ОбластьЗаголовка.Текст = "Работы";
	Диаграмма.РастягиваниеПоВертикали = РастягиваниеПоВертикалиДиаграммыГанта.НеРастягивать;
	Диаграмма.ОтображатьЛегенду = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТочкуДиаграммыГанта(СтрокаДерева, СтруктураСерий, МаксимальнаяДата, МинимальнаяДата)
	
	СерияПлан = ДиаграммаГанта.Серии.Получить(0);
	СерияФакт = ДиаграммаГанта.Серии.Получить(1);
	СерияПрогноз = ДиаграммаГанта.Серии.Получить(2);  
	
	ДатаНачала 		= НачалоДня(СтрокаДерева.ДатаНачалаПлан);
	ДатаОкончания 	= КонецДня(СтрокаДерева.ДатаОкончанияПлан);
	
	ДатаНачалаФакт = НачалоДня(СтрокаДерева.ДатаНачалаФакт);
	
	ДатаОкончанияФакт = КонецДня(?(ЗначениеЗаполнено(СтрокаДерева.ДатаОкончанияФакт),СтрокаДерева.ДатаОкончанияФакт,ПериодОтчета));
	
	Если СтрокаДерева.СуммарнаяРабота И ЗначениеЗаполнено(ДатаОкончанияФакт) И НЕ ЗначениеЗаполнено(ДатаНачалаФакт) Тогда
		
		ДатаНачалаФакт = НачалоДня(СтрокаДерева.ДатаНачалаФакт_Заполненный); 		
		
	КонецЕсли;   	
	
	Точка = ДиаграммаГанта.УстановитьТочку(СтрокаДерева.Работа,СтрокаДерева.Работа.Родитель);
	
	Точка.Расшифровка = СтрокаДерева.Работа; 
	
	ТекстТочки = СтрокаДерева.Работа.КодСДР + " - " + СтрокаДерева.Работа.Наименование; 		 		
	
	Точка.Текст = ТекстТочки;
	
	Если СтрокаДерева.Работа.СуммарнаяРабота Тогда
		Точка.Шрифт = Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина);
	КонецЕсли;
	
	ДиаграммаГанта.РазвернутьТочку(Точка, Истина);
	
	// Инициализируем значение.
	ЗначениеПлан = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияПлан); 	
	
	ЗначениеПлан.Редактирование = Ложь;
	
	ИнтервалПлан        = ЗначениеПлан.Добавить();
	ИнтервалПлан.Начало = ДатаНачала;
	ИнтервалПлан.Конец  = ДатаОкончания;
	
	// Формируем подпись.
	УстановитьТекстЗначения(ИнтервалПлан,"План", СтрокаДерева);
	
	ЗначениеФакт = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияФакт);   	
	
	ЗначениеФакт.Редактирование = Ложь;
	
	Если ЗначениеЗаполнено(ДатаНачалаФакт) Тогда
		
		ИнтервалФакт        = ЗначениеФакт.Добавить();
		ИнтервалФакт.Начало = ДатаНачалаФакт;
		ИнтервалФакт.Конец  = ДатаОкончанияФакт;
		
		УстановитьТекстЗначения(ИнтервалФакт, "Факт", СтрокаДерева); 
		
	КонецЕсли; 
	
	
	Если НЕ СтрокаДерева.Работа.СуммарнаяРабота Тогда
		
		ЗначениеПрогноз = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияПрогноз);
		
		Если СтрокаДерева.Отставание <>0 ИЛИ ЗначениеЗаполнено(СтрокаДерева.Прогноз) Тогда	
			
			ЗначениеПрогноз.Редактирование = Ложь;
			
			ИнтервалПрогноз = ЗначениеПрогноз.Добавить();
			
			Если ЗначениеЗаполнено(СтрокаДерева.Прогноз) Тогда 					
				
				ИнтервалПрогноз.Начало = ?(ЗначениеЗаполнено(ДатаОкончанияФакт),ДатаОкончанияФакт,ДатаОкончания);					
				ИнтервалПрогноз.Конец = СтрокаДерева.Прогноз;
				
			Иначе
				
				ИнтервалПрогноз.Начало = ДатаОкончания;
				ИнтервалПрогноз.Конец = ?(ЗначениеЗаполнено(ДатаОкончанияФакт),ДатаОкончанияФакт,ДатаОкончания);
				
			КонецЕсли;
			
			УстановитьТекстЗначения(ИнтервалПрогноз, "Прогноз", СтрокаДерева);
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Строки = СтрокаДерева.Строки;
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.Работа = СтрокаДерева.Работа Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьТочкуДиаграммыГанта(Строка, СтруктураСерий, МаксимальнаяДата, МинимальнаяДата);
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьТекстЗначения(Интервал, ВидСерии, СтрокаДерева = Неопределено)
	
	ТекстИнтервала = "";
	
	Если СтрокаДерева.Работа.СуммарнаяРабота Тогда
		
		ТекстИнтервала = "(" + Формат(Интервал.Начало, "ДЛФ = Д") + "-" + Формат(Интервал.Конец, "ДЛФ = Д") + ")";
		
	Иначе
		
		Если ВидСерии = "Прогноз" Тогда
			
			Если СтрокаДерева.Отставание <> 0 Тогда
				
				ТекстИнтервала = "Отставание: "+СтрокаДерева.Отставание+" дн.";
				
			КонецЕсли; 			
				
			Если ЗначениеЗаполнено(СтрокаДерева.Прогноз) Тогда
				
				ТекстИнтервала = ""+ТекстИнтервала+""+?(ПустаяСтрока(ТекстИнтервала),"",", ")+"Прогноз: "+Формат(СтрокаДерева.Прогноз,"ДФ=dd.MM.yyyy");
				
			КонецЕсли;  			
			
		Иначе
			
			ТекстИнтервала = "(" + Формат(Интервал.Начало, "ДЛФ = Д") + "-" + Формат(Интервал.Конец, "ДЛФ = Д") + ")";
			
			Если ВидСерии = "Факт" Тогда
				
				ТекстИнтервала = ТекстИнтервала +", вып.: " + Строка(Формат(СтрокаДерева.ПроцентВыполнения,"ЧДЦ=2")) + "%";
				
			ИначеЕсли ВидСерии = "План" Тогда
				
				ТекстИнтервала = ТекстИнтервала +", объем: " + Строка(Формат(СтрокаДерева.ОбъемПлан,"ЧДЦ=3")+" "+СтрокаДерева.ЕдиницаОбъема); 				
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Интервал.Значение.Текст = ТекстИнтервала;
	
КонецПроцедуры

&НаСервере
Процедура ПолосаРегулированияДиаграммыГантаПриИзмененииНаСервере()
	
	ДиаграммаГанта.ПоддержкаМасштаба 					= ПоддержкаМасштабаДиаграммыГанта.Период;
	ДиаграммаГанта.ЕдиницаПериодическогоВарианта 		= ТипЕдиницыШкалыВремени["День"];
	ДиаграммаГанта.КратностьПериодическогоВарианта 		= ?(ПолосаРегулированияДиаграммыГанта < 1, 1, ПолосаРегулированияДиаграммыГанта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолосаРегулированияДиаграммыГантаПриИзменении(Элемент)
	
	ПолосаРегулированияДиаграммыГантаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ПериодОтчета) Тогда
		ПериодОтчета = ТекущаяДата();
	КонецЕсли; 	
	
	ВосстановитьЦвета();
	ЦветСерииПрогнозПриИзменении(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураСерий = Новый Структура;
	
	СерияПлан = ДиаграммаГанта.Серии.Добавить();
	СерияПлан.Значение = "План"; 
	СерияПлан.Текст = "План";
	СтруктураСерий.Вставить("План", СерияПлан);
	
	ЦветСерииПлан = СерияПлан.Цвет;
	
	СерияФакт = ДиаграммаГанта.Серии.Добавить();
	СерияФакт.Значение = "Факт";
	СерияФакт.Текст = "Факт";
	СтруктураСерий.Вставить("Факт", СерияФакт);
	
	ЦветСерииФакт = СерияФакт.Цвет;
	
	СерияПрогноз = ДиаграммаГанта.Серии.Добавить();
	СерияПрогноз.Значение = "Прогноз";
	СерияПрогноз.Текст = "Прогноз";
	СтруктураСерий.Вставить("Прогноз", СерияПрогноз);
	
	ЦветСерииПрогноз = СерияПрогноз.Цвет;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветСерииПрогнозПриИзменении(Элемент)
	
	ДиаграммаГанта.Серии.Получить(0).Цвет = ЦветСерииПлан;
	ДиаграммаГанта.Серии.Получить(1).Цвет = ЦветСерииФакт;
	ДиаграммаГанта.Серии.Получить(2).Цвет = ЦветСерииПрогноз;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		
		СохранитьЦвета();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЦвета()
	
	Структура = Новый Структура;
	
	Структура.Вставить("ЦветСерииПлан",ЦветСерииПлан);
	Структура.Вставить("ЦветСерииФакт",ЦветСерииФакт);
	Структура.Вставить("ЦветСерииПрогноз",ЦветСерииПрогноз);
	
	СохранениеЦветов = ЗначениеВСтрокуВнутр(Структура);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьЦвета()
	
	Если НЕ ПустаяСтрока(СохранениеЦветов) Тогда
		
		Попытка
			
			Структура = ЗначениеИзСтрокиВнутр(СохранениеЦветов);
			
			ЦветСерииПлан = Структура.ЦветСерииПлан;
			
		Исключение
			
		КонецПопытки; 		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
